Разработка_GZ/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СКомитентомНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионеромНаЗакупку</name>
  </enumValues>
  <enumValues>
    <name>СФакторинговойКомпанией</name>
  </enumValues>
  <enumValues>
    <name>СТранспортнойКомпанией</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

Разработка_GZ/src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Организации</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>НомерСчета</name>
    <comment>Номер расчетного счета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <comment>Дата открытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <comment>Дата закрытия счета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкДляРасчетов</name>
    <comment>Банк, в случае непрямых расчетов</comment>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <comment>Расчетный, депозитный, ссудный, иной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКорреспондента</name>
    <comment>Текст &quot;Плательщик\Получатель&quot; в платежных документах</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстНазначения</name>
    <comment>Текст назначения платежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцПрописью</name>
    <comment>Указывать в дате документа месяц прописью</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезКопеек</name>
    <comment>Указывать сумму без копеек, если она в целых рублях</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегдаУказыватьКПП</name>
    <comment>Всегда указывать КПП в платежных документах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйКонтракт</name>
    <type>
      <types>CatalogRef.ГосКонтракты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКорпоративныхРасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБанк</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Разработка_GZ/src/CommonModules/МобильноеПриложениеПредпринимательСобытия/Module.bsl
Процедура ПроверитьИзменениеДатыДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ПроведениеСервер.ГрупповоеПерепроведение(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзлыОбмена = ВыбратьУзлыРегистрацииИзменений(Источник.ОбменДанными.Отправитель);
	Если УзлыОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Источник.ДополнительныеСвойства.Вставить("ДатаДоЗаписи", Источник.Ссылка.Дата);
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Источник.ДополнительныеСвойства.Вставить("ПроверкаДоЗаписи", ПроверитьРеализацию(Источник.Ссылка));
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеДокумента(Источник, Отказ) Экспорт
	
	Если ПроведениеСервер.ГрупповоеПерепроведение(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзлыОбмена = ВыбратьУзлыРегистрацииИзменений(Источник.ОбменДанными.Отправитель);
	Если УзлыОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
		Если Источник.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда
			Для Каждого ДокументРеализации Из Источник.ДокументыОснования Цикл
				Если ТипЗнч(ДокументРеализации.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					ОбъектДляРегистрации = ДокументРеализации.ДокументОснование.ПолучитьОбъект();
					Если ОбъектДляРегистрации <> Неопределено Тогда
						ЗарегистрироватьИзменениеДокумента(ОбъектДляРегистрации, Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Если НЕ ПроверитьРеализацию(Источник) Тогда
			Если Источник.ДополнительныеСвойства.Свойство("ПроверкаДоЗаписи") И 
				Источник.ДополнительныеСвойства.ПроверкаДоЗаписи Тогда
				//Если раньше документ удовлетворял требованиям обмена, надо зарегистрровать его удаление
				ЗарегистрироватьУдаление(Источник, Отказ);
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого УзелОбмена Из УзлыОбмена Цикл
		Если Источник.Дата >= УзелОбмена.ДатаНачалаХраненияДанных ИЛИ
			(Источник.ДополнительныеСвойства.Свойство("ДатаДоЗаписи") И 
			Источник.ДополнительныеСвойства.ДатаДоЗаписи > УзелОбмена.ДатаНачалаХраненияДанных) Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Источник);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеСправочника(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.БанковскиеСчета") Тогда
		Если ЗначениеЗаполнено(Источник.Владелец) И ТипЗнч(Источник.Владелец) <> Тип("СправочникСсылка.Организации") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Банки") ИЛИ
		ТипЗнч(Источник) = Тип("СправочникОбъект.Склады") Тогда
		Если Источник.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Банки") Тогда
		// Если в банке нет счетов наших организаций, то его не требуется передавать в мобильное приложение.
		Если НЕ ЕстьСчетаОрганизацийВБанке(Источник.Ссылка) Тогда
			Возврат;
		КонецЕсли;
    КонецЕсли;

	УзлыОбмена = ВыбратьУзлыРегистрацииИзменений(Источник.ОбменДанными.Отправитель);
	Если УзлыОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Источник);
	
	// При изменении банковского счета нашей организации регистрируем к обмену еще и сам банк.
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.БанковскиеСчета") Тогда
		Если ЗначениеЗаполнено(Источник.Банк) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Источник.Банк);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.БанкДляРасчетов) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Источник.БанкДляРасчетов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзлыОбмена = ВыбратьУзлыРегистрацииИзменений(Источник.ОбменДанными.Отправитель);
	Если УзлыОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СтатусыДокументов") Тогда
		Для каждого Запись Из Источник Цикл
			Если ТипЗнч(Запись.Документ) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Запись.Документ);
			ИначеЕсли ТипЗнч(Запись.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				И ПроверитьРеализацию(Запись.Документ) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Запись.Документ);			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьУдаление(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзлыОбмена = ВыбратьУзлыРегистрацииИзменений(Источник.ОбменДанными.Отправитель);
	Если УзлыОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Данные = Новый УдалениеОбъекта(Источник.Ссылка);
	ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Данные);
	
КонецПроцедуры

Функция ВыбратьУзлыРегистрацииИзменений(УзелОтправитель)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = ПланыОбмена.МобильноеПриложениеПредприниматель.Выбрать();
	
	ЦентральныйУзел = ПланыОбмена.МобильноеПриложениеПредприниматель.ЭтотУзел();
	
	МассивУзлов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.Ссылка = ЦентральныйУзел И НЕ Выборка.Ссылка = УзелОтправитель Тогда
			МассивУзлов.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивУзлов;
	
КонецФункции

Функция ПроверитьРеализацию(Ссылка)
	
	ПроверитьВидОперации = Ложь;
	
	ВидОперации = Ссылка.ВидОперации;
	Если ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия ИЛИ
		ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Товары ИЛИ
		ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги Тогда
		
		ПроверитьВидОперации = Истина;
	КонецЕсли;

	ПроверитьВидДоговора = Ложь;
	ДоговорКонтрагента = Ссылка.ДоговорКонтрагента;
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "ВидДоговора");
		
		Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			ПроверитьВидДоговора = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат (ПроверитьВидОперации И ПроверитьВидДоговора);
	
КонецФункции

Функция ЕстьСчетаОрганизацийВБанке(Банк)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Банк", Банк);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Банк = &Банк
	|	И БанковскиеСчета.Владелец ССЫЛКА Справочник.Организации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.БанкДляРасчетов = &Банк
	|	И БанковскиеСчета.Владелец ССЫЛКА Справочник.Организации";
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции
